spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_with_reference_id.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_103WRy2bKYmLLeQNs7a7dDcx
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_vMbU0m4stwU8Iv83rubhefyU
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        Jacks-iMac.local 12.5.0 Darwin Kernel Version 12.5.0: Sun Sep 29 13:33:47
        PDT 2013; root:xnu-2050.48.12~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 19 Feb 2014 02:01:29 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1944'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_103WRy2bKYmLLeQNs7a7dDcx",
          "created": 1392772995,
          "livemode": false,
          "type": "invoice.payment_succeeded",
          "data": {
            "object": {
              "date": 1392772995,
              "id": "in_103WRy2bKYmLLeQNqsQuek1U",
              "period_start": 1392772995,
              "period_end": 1392772995,
              "lines": {
                "object": "list",
                "count": 1,
                "url": "/v1/invoices/in_103WRy2bKYmLLeQNqsQuek1U/lines",
                "data": [
                  {
                    "id": "sub_3WRyiDiHCbBxAC",
                    "object": "line_item",
                    "type": "subscription",
                    "livemode": false,
                    "amount": 999,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1392772995,
                      "end": 1395192195
                    },
                    "quantity": 1,
                    "plan": {
                      "interval": "month",
                      "name": "The Base Plan",
                      "created": 1392771009,
                      "amount": 999,
                      "currency": "usd",
                      "id": "base",
                      "object": "plan",
                      "livemode": false,
                      "interval_count": 1,
                      "trial_period_days": null,
                      "metadata": {}
                    },
                    "description": null,
                    "metadata": null
                  }
                ]
              },
              "subtotal": 999,
              "total": 999,
              "customer": "cus_3WRyfgX5rfmeD6",
              "object": "invoice",
              "attempted": true,
              "closed": true,
              "paid": true,
              "livemode": false,
              "attempt_count": 0,
              "amount_due": 999,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": 0,
              "next_payment_attempt": null,
              "charge": "ch_103WRy2bKYmLLeQNchSNG1xK",
              "discount": null,
              "application_fee": null,
              "subscription": "sub_3WRyiDiHCbBxAC",
              "metadata": {}
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_3WRyAZFfn2ce0m"
        }
    http_version: 
  recorded_at: Wed, 19 Feb 2014 02:01:33 GMT
recorded_with: VCR 2.8.0
